In [4]:
import numpy as np
import pandas as pd

In [3]:
sozluk1={"isim":["Ahmet","Mehmet","Zeynep","Hasan"],
         "spor":["koşu","yüzme","koşu","basketbol"],
         "kalori":[100,200,250,150]}
sozluk2={"isim":["Osman","Levent","Atlas","Fatma"],
         "spor":["koşu","yüzme","koşu","basketbol"],
         "kalori":[100,200,250,150]}
sozluk3={"isim":["Ayse","Mahmut","Duygu","Nur"],
         "spor":["koşu","yüzme","Badminton","Tenis"],
         "kalori":[400,500,100,200]}

In [4]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [5]:
dataFrame1

     isim       spor  kalori
0   Ahmet       koşu     100
1  Mehmet      yüzme     200
2  Zeynep       koşu     250
3   Hasan  basketbol     150

In [6]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [7]:
dataFrame2

     isim       spor  kalori
4   Osman       koşu     100
5  Levent      yüzme     200
6   Atlas       koşu     250
7   Fatma  basketbol     150

In [8]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [9]:
dataFrame3

      isim       spor  kalori
8     Ayse       koşu     400
9   Mahmut      yüzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     200

## Concatenation

In [12]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=1)

,isim,spor,kalori,isim,spor,kalori,isim,spor,kalori
0,Ahmet,koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,Mehmet,yüzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,Zeynep,koşu,250.0,NaN,NaN,NaN,NaN,NaN,NaN
3,Hasan,basketbol,150.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,Osman,koşu,100.0,NaN,NaN,NaN
5,NaN,NaN,NaN,Levent,yüzme,200.0,NaN,NaN,NaN
6,NaN,NaN,NaN,Atlas,koşu,250.0,NaN,NaN,NaN
7,NaN,NaN,NaN,Fatma,basketbol,150.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,Ayse,koşu,400.0
9,NaN,NaN,NaN,NaN,NaN,NaN,Mahmut,yüzme,500.0
10,NaN,NaN,NaN,NaN,NaN,NaN,Duygu,Badminton,100.0
11,NaN,NaN,NaN,NaN,NaN,NaN,Nur,Tenis,200.0

In [13]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      isim       spor  kalori
0    Ahmet       koşu     100
1   Mehmet      yüzme     200
2   Zeynep       koşu     250
3    Hasan  basketbol     150
4    Osman       koşu     100
5   Levent      yüzme     200
6    Atlas       koşu     250
7    Fatma  basketbol     150
8     Ayse       koşu     400
9   Mahmut      yüzme     500
10   Duygu  Badminton     100
11     Nur      Tenis     200

## merge

In [16]:
mergeSozluk1={"Isim":["Ahmet","Mehmet","Elif"],
              "Spor":["Futbol","Koşu","Voleybol"]
             }
mergeSozluk2={"Isim":["Mehmet","Ahmet","Elif"],
             "Kalori":[100,200,300]
             }

In [17]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)
mergeDataFrame2=pd.DataFrame(mergeSozluk2)

In [18]:
mergeDataFrame1

     Isim      Spor
0   Ahmet    Futbol
1  Mehmet      Koşu
2    Elif  Voleybol

In [19]:
mergeDataFrame2

     Isim  Kalori
0  Mehmet     100
1   Ahmet     200
2    Elif     300

In [20]:
mergeDataFrame1.merge(mergeDataFrame2)

     Isim      Spor  Kalori
0   Ahmet    Futbol     200
1  Mehmet      Koşu     100
2    Elif  Voleybol     300

In [22]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim      Spor  Kalori
0   Ahmet    Futbol     200
1  Mehmet      Koşu     100
2    Elif  Voleybol     300

In [24]:
maassozluk={"Isim":["Atil","Zeynep","Mehmet","Hasan"],
           "Departman":["Yazılım","Satis","Pazarlama","Yazılım"],
            "Maas":[200,300,400,500]
           }

In [25]:
maasDataFrame=pd.DataFrame(maassozluk)

In [26]:
maasDataFrame

     Isim  Departman  Maas
0    Atil    Yazılım   200
1  Zeynep      Satis   300
2  Mehmet  Pazarlama   400
3   Hasan    Yazılım   500

In [38]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satis', 'Pazarlama'], dtype=object)

In [39]:
maasDataFrame["Departman"].nunique()

3

In [41]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Satis        1
Pazarlama    1
Name: Departman, dtype: int64

In [46]:
def bruttennete(maas):
    return  maas*0.66

In [47]:
maasDataFrame["Maas"].apply(bruttennete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [48]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [49]:
yeniBirVeri={"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson"],
            "Karakter ismi":["Cartman","Kenny","Homer","Bart"],
            "Karakter Yas":[9,10,50,20]
            }

In [50]:
karakterDataFrame=pd.DataFrame(yeniBirVeri)

In [51]:
karakterDataFrame

  Karakter Sınıfı Karakter ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20

In [53]:
karakterDataFrame.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter ismi"])

                               Karakter Yas
Karakter Sınıfı Karakter ismi
Simpson         Bart                     20
                Homer                    50
South Park      Cartman                   9
                Kenny                    10

In [55]:
yeniBirData={"Karakter Sınıfı":["South Park","South Park","Simpson","Simpson","Simpson"],
            "Karakter ismi":["Cartman","Kenny","Homer","Bart","Bart"],
            "Karakter Yas":[9,10,50,20,10]
            }

In [57]:
yeniKarakterDataFrame=pd.DataFrame(yeniBirData)

In [59]:
yeniKarakterDataFrame

  Karakter Sınıfı Karakter ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [61]:
yeniKarakterDataFrame.pivot_table(values="Karakter Yas",index=["Karakter Sınıfı","Karakter ismi"],aggfunc=np.sum)

                               Karakter Yas
Karakter Sınıfı Karakter ismi
Simpson         Bart                     30
                Homer                    50
South Park      Cartman                   9
                Kenny                    10